{
	"title_before_name": "Ing.",
	"name": "Drahomír Dlabaja",
	"title_after_name": "",
	"position": "Tech Lead",
	"phone": "+420 605 401 878",
	"email": "dr.dlabaja@gmail.com",
	"location": "Brno, Královo Pole",
	"photo": "https://media.licdn.com/dms/image/v2/D4E03AQEBCuikzl3_fw/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1667673467302?e=1731542400&v=beta&t=GEO5paXo45hY2iImczDVenHmoZCXMSUgtYpNNd__vhw",
	"description": "Skilled software engineer with a proven ability to analyze complex problems, propose a set of solutions along with their strengths and weaknesses, and implement the solutions according to the needs of the team. Proactive strategic thinker who can get things done.",
	"skills": [
		{
			"name": "C++",
			"level": 100
		},
		{
			"name": "Git",
			"level": 100
		},
		{
			"name": "CMake",
			"level": 100
		},
		{
			"name": "Python",
			"level": 80
		},
		{
			"name": "Computer Graphics",
			"level": 60
		},
		{
			"name": "C#",
			"level": 60
		}
	],
	"interests": [
		"Bouldering",
		"Running",
		"3D Printing",
		"Cooking",
		"Hiking",
		"Music",
		"Coffee Science"
	],
	"github": "github.com/xdlaba02",
	"linkedin": "linkedin.com/in/dlabajad",
	"experience": [
		{
			"title": "Tech Lead",
			"company": "Chyron",
			"start_month": "06",
			"start_year": "2024",
			"end_month": "",
			"end_year": "",
			"description": "Mentoring and aiding team members with technical knowledge and best practices. Defining the technical direction and architecture of the product, ensuring it aligns with business goals. Promoting healthy development practices, introducing agility into our processes with measurable positive outcomes. Research and experimentation with new technologies, encouraging innovation within the team. Management of the technical state of the product, ensuring smooth development and operations processes. Communication with engineers, testers, and stakeholders regarding the technical state and future vision."
		},
		{
			"title": "Senior Software Engineer",
			"company": "Chyron",
			"start_month": "03",
			"start_year": "2023",
			"end_month": "06",
			"end_year": "2024",
			"description": "Maintenance and renovation of a 20-year-old 10M LOC legacy codebase. Management of CI/CD pipelines, build systems, and build environment. Decision making about future development processes, risk/reward analysis. Evaluation of existing & new code quality, conducting code reviews. Management of technical debt, creation and maintenance of technical documentation."
		},
		{
			"title": "Software Developer",
			"company": "TESCAN 3DIM, s.r.o.",
			"start_month": "04",
			"start_year": "2021",
			"end_month": "03",
			"end_year": "2023",
			"description": "Engineering of data structures for spatial query acceleration. Implementation of mechanisms for task parallelism that allows safe interaction within a thread-unsafe environment. Research of algorithms for robust mesh booleans. Development of new platform-independent build architecture for existing codebase based on modern CMake and Conan."
		},
		{
			"title": "Researcher",
			"company": "Brno University of Technology",
			"start_month": "06",
			"start_year": "2019",
			"end_month": "12",
			"end_year": "2020",
			"description": "Researched new state-of-the-art methodologies for compression of 4D light-field image data. Published work in Multimedia Tools and Applications journal and presented at the WSCG conference. The code is publicly available as an open-source library."
		}
	],
	"education": [
		{
			"title": "Master's Degree",
			"institution": "Brno University of Technology",
			"subinstitution": "Faculty of Information Technology",
			"end_year": "2022",
			"description": "Specialization in Computer Graphics and Interaction. Thesis on visualization of large volumetric data on CPU with emphasis on data structures, cache coherency, parallelization, and vectorization. Developed in cooperation with TESCAN 3DIM, s.r.o."
		},
		{
			"title": "Bachelor's Degree",
			"institution": "Brno University of Technology",
			"subinstitution": "Faculty of Information Technology",
			"end_year": "2019",
			"description": "Thesis on lossy light field compression. Received Dean's award for excellent bachelor's thesis and presented research at the Excel@FIT student conference, earning recognition for quality work and experimental results."
		}
	]
}